#+TITLE: async-macros
#+CATEGORY: async-macros
#+STARTUP: overview 
#+STARTUP: hidestars
#+PROPERTY: Assigned_to_ALL kordano
#+OPTIONS: d:nil
**** Overview

A collection of clojurescript =core.async= macros.

**** Usage
```
lein run -m clojure.main node_repl.cljs
```
**** TODOs
***** STARTED create cljs repl                                      :feature:
     DEADLINE: <2015-08-14 Fri>
     :LOGBOOK:  
     - State "STARTED"    from "TODO"       [2015-08-14 Fri 17:17]
     CLOCK: [2015-08-14 Fri 17:00]
     :END:      
     :PROPERTIES:
     :Created: [2015-08-14 Fri 15:17]
     :Assigned_to: kordano
     :END:
***** CANCELED add figwheel                                    :feature:test:
      CLOSED: [2015-08-12 Wed 17:13] DEADLINE: <2015-08-12 Wed>
     :LOGBOOK:  
     - State "CANCELED"   from "STARTED"    [2015-08-12 Wed 17:13] \\
       not useful at the moment
     - State "STARTED"    from "TODO"       [2015-08-12 Wed 16:39]
     CLOCK: [2015-08-12 Wed 16:39]--[2015-08-12 Wed 17:13] =>  0:34
     :END:      
     :PROPERTIES:
     :Created: [2015-08-12 Wed 16:38]
     :Assigned_to: kordano
     :END:
***** STARTED add unit tests					       :test:
 DEADLINE: <2015-08-13 Thu>
 :LOGBOOK:  
 CLOCK: [2015-08-13 Thu 11:11]--[2015-08-14 Fri 17:00] => 29:49
 CLOCK: [2015-08-12 Wed 17:13]--[2015-08-12 Wed 17:13] =>  0:00
 - State "STARTED"    from "TODO"       [2015-08-05 Mi 13:45]
 CLOCK: [2015-08-03 Mo 15:44]--[2015-08-03 Mo 17:54] =>  2:10
 CLOCK: [2015-08-03 Mo 13:59]--[2015-08-03 Mo 15:36] =>  1:37
 CLOCK: [2015-08-03 Mo 13:41]--[2015-08-03 Mo 13:59] =>  0:18
 :END:      
 :PROPERTIES:
 :Created: [2015-08-03 Mo 13:35]
 :Assigned_to: kordano
 :END:
**** References
**** License

Copyright © 2015 Konrad Kühne

Distributed under the Eclipse Public License either version 1.0 or (at
your option) any later version.


